; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	spectrograph0 - mode
	infrared2 - mode
	image1 - mode
	GroundStation2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	GroundStation8 - direction
	Star9 - direction
	GroundStation1 - direction
	Star7 - direction
	Star0 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star9)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star9)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 Star7)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation8)
)
(:goal (and
	(pointing satellite1 Planet13)
	(pointing satellite2 Planet13)
	(have_image Star10 spectrograph0)
	(have_image Planet11 spectrograph0)
	(have_image Planet12 image1)
	(have_image Planet13 infrared2)
	(have_image Phenomenon14 spectrograph0)
))

)

; plan
1. (turn_to satellite2 planet13 groundstation8)
   deleted: (pointing satellite2 groundstation8)
   added: (pointing satellite2 planet13)
   goals met: 1 of 7
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 7
3. (calibrate satellite1 instrument1 star9)
   added: (calibrated instrument1)
   goals met: 1 of 7
4. (turn_to satellite1 phenomenon14 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon14)
   goals met: 1 of 7
5. (turn_to satellite0 star9 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star9)
   goals met: 1 of 7
6. (take_image satellite1 phenomenon14 instrument1 spectrograph0)
   added: (have_image phenomenon14 spectrograph0)
   goals met: 2 of 7
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 7
8. (calibrate satellite0 instrument0 star9)
   added: (calibrated instrument0)
   goals met: 2 of 7
9. (turn_to satellite0 planet11 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet11)
   goals met: 2 of 7
10. (take_image satellite0 planet11 instrument0 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 3 of 7
11. (turn_to satellite0 planet12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet12)
   goals met: 3 of 7
12. (take_image satellite0 planet12 instrument0 image1)
   added: (have_image planet12 image1)
   goals met: 4 of 7
13. (turn_to satellite0 star10 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star10)
   goals met: 4 of 7
14. (take_image satellite0 star10 instrument0 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 5 of 7
15. (turn_to satellite1 planet13 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 planet13)
   goals met: 6 of 7
16. (take_image satellite1 planet13 instrument1 infrared2)
   added: (have_image planet13 infrared2)
   goals met: 7 of 7
